#!/bin/zsh

##########################################################################################################################################################
#
# 지역정산 포항 보고서 작업
#
##########################################################################################################################################################
unmask 002

SYSTEM_CODE=$1

echo "##########################################"
echo "$(date) : ### Region_Report_PH.sh start."
echo "_SYSTEM_CODE[$SYSTEM_CODE]"

echo "JAB_CreateReportFile($SYSTEM_CODE)"
#JAB_UpdateJobStatus($SYSTEM_CODE, $WORK_ID, $WORK_STS
sleep 1s

echo "$(date) : ### UpdateJobStatus_PH.sh finish."
echo "##########################################"
